"""
Цикл
Ввести с клавиатуры строку.
Вывести эту же строку вертикально: по одному символу на строку консоли.
"""

str = input('Напечатайте строку: ')
str1 = str

for char in str1:
    print(char)